tap "autogit-ai/tap"
tap "ozankasikci/tap"
tap "withgraphite/tap"
brew "atuin"
brew "awscli"
brew "bat"
brew "ccache"
brew "cloudflared"
brew "cocoapods"
brew "direnv"
brew "duti"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "flyctl"
brew "fzf"
brew "gh"
brew "git-delta"
brew "git-lfs"
brew "glow"
brew "httpie"
brew "imessage-exporter"
brew "jq"
brew "libpq"
brew "make"
brew "mise"
brew "mole"
brew "neovim"
brew "poppler"
brew "pyenv"
brew "ripgrep"
brew "ruby@3.3"
brew "telnet"
brew "tlrc"
brew "tree"
brew "uv"
brew "watchman"
brew "wget"
brew "xcodegen"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "autogit-ai/tap/autogit"
brew "withgraphite/tap/graphite"
cask "ozankasikci/tap/agent-sessions"
cask "font-jetbrains-mono-nerd-font"
cask "gcloud-cli"
cask "ngrok"
cask "tailscale-app"
cask "ungoogled-chromium"
cask "zulu@17"
