tap "autogit-ai/tap"
tap "ozankasikci/tap"
tap "withgraphite/tap"
brew "atuin"
brew "awscli"
brew "bat"
brew "ccache"
brew "cloudflared"
brew "cocoapods"
brew "direnv"
brew "duti"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "flyctl"
brew "fzf"
brew "gh"
brew "git-delta"
brew "git-lfs"
brew "glow"
brew "httpie"
brew "imessage-exporter"
brew "jq"
brew "libpq"
brew "make"
brew "mas"
brew "mise"
brew "mole"
brew "neovim"
brew "poppler"
brew "pyenv"
brew "ripgrep"
brew "ruby@3.3"
brew "telnet"
brew "tlrc"
brew "tree"
brew "uv"
brew "watchman"
brew "wget"
brew "xcodegen"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "autogit-ai/tap/autogit"
brew "withgraphite/tap/graphite"
cask "ozankasikci/tap/agent-sessions"
cask "font-jetbrains-mono-nerd-font"
cask "gcloud-cli"
cask "ngrok"
cask "tailscale-app"
cask "ungoogled-chromium"
cask "zulu@17"
mas "Bear", id: 1091189122
mas "Copilot", id: 1447330651
mas "Cronica", id: 1614950275
mas "DaisyDisk", id: 411643860
mas "Dark Reader for Safari", id: 1438243180
mas "Deliveries", id: 290986013
mas "Developer", id: 640199958
mas "Download Shuttle", id: 847809913
mas "Final Cut Pro", id: 424389933
mas "Flighty", id: 1358823008
mas "GarageBand", id: 682658836
mas "iDownloader", id: 1220730126
mas "iMovie", id: 408981434
mas "InjectionIII", id: 1380446739
mas "Keynote", id: 361285480
mas "Keynote", id: 409183694
mas "MKPlayer", id: 1335612105
mas "Movie Tracker", id: 6443877426
mas "Numbers", id: 409203825
mas "Numbers", id: 361304891
mas "Pages", id: 409201541
mas "Pages", id: 361309726
mas "Parcel", id: 375589283
mas "Perplexity", id: 6714467650
mas "POOLS", id: 6670792878
mas "Sasquatch", id: 1465346522
mas "Things", id: 904280696
mas "Tripsy", id: 1429967544
mas "Windows App", id: 1295203466
mas "Wipr", id: 1662217862
mas "Xcode", id: 497799835
